Revit 2027 API
DocumentClosedEventArgs.DocumentId Property
 Id of the document that has just been closed.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int DocumentId { get; }
Public ReadOnly Property DocumentId As Integer
	Get
public:
property int DocumentId {
	int get ();
}
member DocumentId : int with get
Property Value
Int32
Remarks
 This Id is only used to identify the document for the duration of this event and the DocumentClosing event which preceded it. It serves as synchronization means for the pair of events.
See Also
Reference
DocumentClosedEventArgs Class
Autodesk.Revit.DB.Events Namespace